Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །དགེ་བའི་རྩ་བ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: Through that root of merit may we attain complete and perfect enlightenment.’ “

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུས་སྨྲས་པ།
en: The mahārāja Vaiśravaṇa said to them, ‘Now listen.

source: ཁྱེད་ཅག་ཉོན་ཅིག །ཁྱེད་ཅག་ལས་གང་སུ་དགེ་བའི་རྩ་བ་འདོད་པ་དང་། བསོད་ནམས་འདོད་པས་ལོ་བདུན་དུ་གང་གི་ཕྱིར་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞལ་ཟས་སྦྱོར་བར་འགྱུར་བའི་ཙན་དན་ས་མཆོག་པ་དང་།
en: Because you wish for good actions and wish for merit, you should fetch gośīrṣa sandalwood and uragasāra sandalwood from the other side of the ocean so that the brahmin Samudrareṇu may provide food for seven years to the Bhagavat and his saṅgha.’ “

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དག་རྒྱ་མཚོའི་ཕ་རོལ་ནས་ལོང་ཤིག །དེ་ནས་གནོད་སྦྱིན་དགུ་ཁྲི་ཉིས་སྟོང་གིས་ཚིག་འཐུན་པར་སྨྲས་པ། གྲོགས་པོ་དག་བདག་ཅག་གིས་ལོ་བདུན་པོ་འདི་ལ་གང་གི་ཕྱིར་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར་ཞལ་ཟས་སྦྱོར་བར་འགྱུར་བའི་ཙན་དན་ས་མཆོག་པ་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དག་བླང་བར་བྱའོ།
en: Then 92,000 yakṣas said with one voice, ‘Friends, we shall fetch gośīrṣa sandalwood and uragasāra sandalwood from the other side of the ocean so that the brahmin Samudrareṇu may provide food for seven years to the Bhagavat and his saṅgha of bhikṣus.’ “ ‘

source: །གནོད་སྦྱིན་བཞི་ཁྲི་དྲུག་སྟོང་གིས་སྨྲས་པ། བདག་ཅག་གིས་ནི་སྤོས་བླང་བར་བྱའོ།
en: We shall fetch incense,’ said 46,000 yakṣas. ‘

source: །གནོད་སྦྱིན་ལྔ་ཁྲི་ཉིས་སྟོང་གིས་སྨྲས་པ། བདག་ཅག་གིས་ནི་མེ་ཏོག་སྣ་ཚོགས་དག་བླང་བར་བྱའོ།
en: We shall fetch a variety of flowers,’ said 52,000 yakṣas. ‘

source: །གནོད་སྦྱིན་ཉི་ཁྲིས་སྨྲས་པ། བདག་ཅག་གིས་ནི་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར་སྨན་བཅུད་ཀྱིས་ལེན་སྣ་ཚོགས་དག་གི་མཐུ་བླངས་ལ་ཞལ་ཟས་དང་། སྩང་ནན་སྦྱོར་བར་འགྱུར་བ་གང་ཡིན་པ་དེར་མཐུ་གཞུག་པར་བྱའོ།
en: We shall obtain the power of a variety of life-sustaining herbs for the Bhagavat and his saṅgha of bhikṣus and put that power into whatever food and drink is prepared,’ said 20,000 yakṣas. ‘

source: །གནོད་སྦྱིན་བདུན་ཁྲིས་སྨྲས་པ། གྲོགས་པོ་དག་བདག་ཅག་གིས་ནི་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞལ་ཟས་སྦྱར་བར་བྱའོ།
en: Friends, we shall prepare the food for the Bhagavat and his saṅgha of bhikṣus,’ said 70,000 yakṣas. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་མཐོང་བར་འདོད་པ་དང་།
en: Noble son, the brahmin Samudrareṇu then wished to see the mahārāja Virūḍhaka.

source: དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ཅིང་གྲུལ་བུམ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བར་དང་། དེ་བཞིན་དུ་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་དང་། ཡུལ་འཁོར་སྲུང་དང་།
en: Then the mahārāja Virūḍhaka came to where the brahmin Samudrareṇu and so on was, up to and including many hundreds of thousands of kumbhāṇḍas, who developed the aspiration for the highest, most complete enlightenment.

source: ཀླུ་དང་། དྲི་ཟ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བར་དུ་སྔ་མ་བཞིན་ནོ།
en: In the same way, the mahārājas Virūpākṣa and Dhṛtarāṣṭra and many hundreds of thousands of millions of trillions of nāgas and gandharvas developed the aspiration for the highest, most complete enlightenment.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་གླིང་བཞི་བ་གཉིས་པའི་འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱང་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་གན་དུ་འོངས་པ་དང་། བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས།
en: Then, through the power of the Buddha, the guardians of a second world of four continents came to the brahmin Samudrareṇu, and the brahmin Samudrareṇu caused them to aspire to the highest, most complete enlightenment.

source: དེ་དག་ཀྱང་དོང་སྟེ་རང་རང་གི་འཁོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: They returned and directed their own retinues to the highest, most complete enlightenment. “

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྣམ་ཐོས་ཀྱི་བུ་ཐེར་འབུམ་འཁོར་དང་བཅས་པ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །འཕགས་སྐྱེས་པོ་ཐེར་འབུམ་དང་། མིག་མི་བཟང་ཐེར་འབུམ་དང་། ཡུལ་འཁོར་སྲུང་ཐེར་འབུམ་འཁོར་དང་བཅས་པ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: This continued until a billion Vaiśravaṇas, a billion Virūḍhakas, a billion Virūpākṣas, a billion Dhṛtarāṣṭras, and all their retinues had been directed to the highest, most complete enlightenment.

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་བདག་གི་རེ་བ་ཡང་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་ལ། གལ་ཏེ་བདག་གི་སྨོན་ལམ་ཡང་ཡང་དག་པར་འགྲུབ་པར་འགྱུར་བ་ལྟ་ན་བདག་འདོད་པ་ན་སྤྱོད་པའི་ལྷ་རྣམས་ལ་མཆོད་སྦྱིན་ཆེན་པོ་འདིའི་བསོད་ནམས་ཡང་དག་པར་བགོ་བཤའ་བྱེད་པར་གྱུར་ཅིག །
en: Then, noble son, the brahmin Samudrareṇu thought, ‘If I am to attain the complete enlightenment of perfect buddhahood, if my wish is to be fulfilled, and if my prayer is to be fulfilled, may the devas who carry out my wishes share in the merit of this great offering.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་གྱུར་ཅིག །
en: May they truly aspire to the highest, most complete enlightenment.

source: གལ་ཏེ་བདག་བསོད་ནམས་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལྟ་ན་དེང་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བདག་ལ་ལྟ་བའི་ཕྱིར་འདིར་འོང་བར་གྱུར་ཅིག །ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་།
en: If through this merit I am to attain the complete enlightenment of perfect buddhahood, may Śakra, the lord of the devas, come here to see me today.

source: ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དང་། ལྷའི་བུ་རབ་འཕྲུལ་དང་། ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱང་བདག་ལ་བལྟ་བའི་ཕྱིར་འདིར་འོང་བར་གྱུར་ཅིག་སྙམ་མོ།
en: And may the deva Suyāma, the deva Saṃtuṣita, the deva Sunirmita, and the deva Para­nirmitavaśavartin come here to see me.’ “

source: །རིགས་ཀྱི་བུ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་སྙམ་དུ་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་བྲམ་ཟེ་དེ་ལྟ་བའི་ཕྱིར་འོངས་སོ། །ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་། ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དང་། ལྷའི་བུ་རབ་འཕྲུལ་དང་། ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱང་བྲམ་ཟེ་དེ་ལྟ་བའི་ཕྱིར་འོངས་ནས།
en: Noble son, as soon as the brahmin Samudrareṇu developed that aspiration, Śakra, lord of devas, and the devas Suyāma, Saṃtuṣita, Sunirmita, and Para­nirmitavaśavartin came to see the brahmin. “

source: བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་དེ་དག་ལ་ཁྱེད་ཅག་སུ་ཡིན་ཞེས་དྲིས་པ་དང་།
en: The brahmin asked, ‘Who are you?’ “

source: ལྷའི་རྒྱལ་པོ་ལྔ་པོ་དག་གིས་རང་རང་གི་མིང་རུས་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་བྲམ་ཟེ་ཁོ་བོ་ཅག་ལ་བསྒོ་བ་ནི་ཅི་ཞིག་ཡོད།
en: The five kings of the devas each told him his name and his class of deities and asked, ‘O brahmin, what is your command?

source: མཆོད་སྦྱིན་ཆེན་པོ་འདི་ལ་ཁོ་བོ་ཅག་གིས་ཡོ་བྱད་དག་སྦྱར་བར་བྱ་བ་ལྟ་ཅི་ཡོད། བྲམ་ཟེས་སྨྲས་པ། བཅོམ་ལྡན་འདས་དང་།
en: What preparations should we make for this great offering?’ “

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར་ཁྱེད་ཅག་ལྷའི་འཇིག་རྟེན་ན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་དག་དང་། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དག་དང་། དཔག་བསམ་གྱི་ཤིང་ལྗོན་པ་དག་དང་། སྤོས་ཀྱི་ཤིང་ལྗོན་པ་དག་དང་། མེ་ཏོག་གི་ཤིང་ལྗོན་པ་དག་དང་། འབྲས་བུའི་ཤིང་ལྗོན་པ་དག་དང་། ལྷའི་ན་བཟའ་དག་དང་། ལྷའི་གདན་དག་དང་། ལྷའི་གདིང་བ་དག་དང་། ལྷའི་རིན་པོ་ཆེའི་སྣོད་དག་དང་། ལྷའི་རྒྱན་དག་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ལྷབ་ལྷུབ་དག་དང་། ལྷའི་རོལ་མོའི་སྒྲ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་འཛམ་བུའི་ཚལ་ཐམས་ཅད་བརྒྱན་པར་གྱིས་ཤིག །
en: The brahmin said, ‘For the Bhagavat and his saṅgha of bhikṣus, you should adorn the entire Jambūvana Park with precious, divine kūṭāgāras that are superior to all others, and with precious trees, wish-fulfilling trees, incense trees, flower trees, fruit trees, divine food, divine cloth, divine cushions, divine mats, divine precious bowls, divine ornaments, parasols, victory banners, flags, streamers, and the sound of divine music.’ “

source: ལྷའི་རྒྱལ་པོ་ལྔ་པོ་དེ་དག་གིས་གྲོགས་པོ་དེ་ལྟར་བྱའོ་ཞེས་བྲམ་ཟེའི་ལྟར་མཉན་ཏེ། བྲམ་ཟེའི་དྲུང་ནས་ཕྱིར་ལོག་ནས་ལྷའི་འཇིག་རྟེན་དུ་དོང་སྟེ་ཕྱིན་པ་དང་། ལྷའི་བུ་འཁྲི་བྱེད་དང་། ལྷའི་བུ་འཁྱིལ་བྱེད་དང་། ལྷའི་བུ་སྣར་མ་སྐྱེས་དང་།
en: The five kings of the devas said, ‘Friend, we shall do so,’ and obeying the brahmin, they left and returned to their paradises.

source: ལྷའི་བུས་རྩོམ་དགའ་རྣམས་བོས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་ཁྱེད་ཅག་དེང་ལ་འཛམ་བུའི་གླིང་དུ་བབས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་རྒྱན་གྱི་ཁྱད་པར་སྣ་ཚོགས་དག་དང་། གདན་དང་། གདིང་བ་སྣ་ཚོགས་དག་གིས་ཇི་ལྟར་ལྷའི་འཇིག་རྟེན་འདི་བརྒྱན་པ་དེ་ལྟ་བུ་དག་གིས་བརྒྱན་པར་གྱིས་ཤིག །
en: They summoned the devas Veṭaka, Āvetuka, Rohiṇa, Korabha, and Nanda, and said to them, ‘Friends, go down today to Jambudvīpa and adorn the Jambūvana Park with a variety of special adornments and seats and various mats, just like the deva world is adorned.

source: གྲོགས་པོ་དག་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་འདི་ལྟ་བུ་ཡང་བརྩིག་ཏུ་ཆུག་ཤིག །
en: Friends, build a precious kūṭāgāra there for the Bhagavat.

source: འདི་ལྟ་སྟེ། ཁང་པ་བརྩེགས་པ་རིན་པོ་ཆེའི་བ་གམ་ཅན་འདི་ཅི་འདྲ་བ་དེ་ལྟ་བུའི་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་བརྩིག་ཏུ་ཆུག་ཤིག །
en: Build a kūṭāgāra with a precious spire just like this palace.’ “

source: ལྷའི་བུ་དེ་ལྔས་ལྷའི་རྒྱལ་པོ་རྣམས་ཀྱི་ལྟར་མཉན་ནས་འཛམ་བུའི་གླིང་དུ་བབས་ཏེ།
en: Those five devas obeyed the deva kings and descended to Jambudvīpa.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་མཚན་གཅིག་གིས་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ཐམས་ཅད་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དག་དང་། རྒྱལ་མཚན་གྱི་བར་དག་གི་རྒྱན་དེ་ལྟ་བུ་དག་གིས་བརྒྱན་ཏོ།
en: In one night, for the Bhagavat, they completely adorned the entire Jambūvana Park with every kind of adornment, from precious trees to victory banners.

source: །འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ཁང་པ་བརྩེགས་པ་རིན་པོ་ཆེའི་བ་གམ་ཅན་ཅི་འདྲ་བ་དེ་ལྟ་བུའི་ཁང་པ་བརྩེགས་པ་ཡང་བརྩིགས་ཏེ།
en: They also built a kūṭāgāra with a precious spire for the Bhagavat that was just like the palace of Śakra, lord of devas.

source: འཛམ་བུའི་ཚལ་ཐམས་ཅད་ལྷའི་རྒྱན་གྱིས་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་མཐར་ཐུག་པར་བརྒྱན་ནས་ལྷའི་རྒྱལ་པོ་རྣམས་ཀྱི་གན་དུ་སོང་སྟེ་སྨྲས་པ། གྲོགས་པོ་དག་མཁྱེན་པར་མཛོད་ཅིག །
en: When they had completely adorned Jambūvana with every kind of divine adornment, they returned to the presence of the deva kings and said to them, ‘Friends, know this.

source: ཇི་ལྟར་ལྷའི་འཇིག་རྟེན་འདི་ལེགས་པར་བརྒྱན་པ་དེ་བཞིན་དུ། བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ཡང་ལྷའི་རྒྱན་གྱི་ཁྱད་པར་རྣམས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་མཐར་ཐུག་པར་བརྒྱན་ཅིང་འདི་ལྟ་སྟེ།
en: The entire Jambūvana Park has been completely and perfectly adorned with divine adornments, just as this deva world is excellently adorned.

source: དཔེར་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ཁང་པ་བརྩེགས་པ་རིན་པོ་ཆེའི་བ་གམ་ཅན་ཅི་འདྲ་བ་དེ་ལྟ་བུའི་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁང་པ་བརྩེགས་པ་ཡང་བརྩེགས་ལགས་ཏེ།
en: We have built for the Bhagavat a kūṭāgāra made from all precious materials and with a precious spire, just like the palace of Śakra, the lord of the devas.

source: གྲོགས་པོ་དག་ལྷའི་འཇིག་རྟེན་དང་། འཛམ་བུའི་གླིང་གི་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ནི་ཁྱད་པར་ཅུང་ཟད་ཀྱང་མ་མཆིས་སོ།
en: Friends, there is now not even the slightest difference between the deva world and the Jambūvana Park in Jambudvīpa.’ “

source: །དེ་ནས་ལྷའི་རྒྱལ་པོ་ལྔ་པོ་བརྒྱ་བྱིན་དང་རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དེ་དག་འཛམ་བུའི་གླིང་དུ་བབས་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་དྲུང་དུ་སོང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེ་བཅོམ་ལྡན་འདས་དང་།
en: Then the five kings of the devas, Śakra, Suyāma, Saṃtuṣita, Sunirmita, and Para­nirmitavaśavartin, descended to Jambudvīpa, came to the brahmin Samudrareṇu, and said to him, ‘Brahmin, we have adorned Jambūvana for the Bhagavat and his saṅgha of bhikṣus.

source: དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར་འཛམ་བུའི་ཚལ་ནི་བརྒྱན་ཟིན་ན་ཡང་ཁོ་བོ་ཅག་གིས་བྱ་བ་ལྟ་ཅི་ཡོད།
en: What else can we do?’ “

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ལྷའི་བུ་ལྔ་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The brahmin Samudrareṇu said to the five deva kings, ‘You five deva kings each rule over a class of devas.

source: །ལྷའི་རྒྱལ་པོ་ཁྱེད་ལྔ་ནི་ལྷའི་རིས་སོ་སོ་ན་རྒྱལ་སྲིད་བྱེད་པ་ཡིན་པས་དེ་ན་ཁྱེད་ཅག་གི་དབང་དུ་འགྱུར་གྱིས་ལྷའི་རྒྱལ་པོ་དག་དེང་ལ་རང་རང་གི་ལྷའི་འཁོར་རྣམས་བསྡུས་ཏེ་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་འཛམ་བུའི་གླིང་དུ་ཤེག་ལ་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཀྱང་ཉོན་ཅིག །
en: Therefore, as you have that power, you deva kings should today gather together your retinues of devas and say to them, “Go to Jambudvīpa in order to see, pay homage to, and honor the Bhagavat and his saṅgha of bhikṣus and listen to the Dharma from the Bhagavat.” ’ “

source: དེ་ནས་ལྷའི་རྒྱལ་པོ་དེ་ལྔ་རང་རང་གི་གནས་ཀྱི་ཁྱད་པར་རྣམས་སུ་དོང་སྟེ་ཕྱིན་པ་དང་།
en: Then the five deva kings each returned to his own particular realm.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བསྡུས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: Śakra, lord of devas, assembled the Trāyastriṃśa devas and said to them, ‘Honorable ones, know this!

source: འཛམ་བུའི་གླིང་ན་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱི་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ཅེས་བྱ་བ་དེས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དགེ་སློང་གི་དགེ་འདུན་དཔག་ཏུ་མེད་པ་དང་བཅས་པ་ལ་ལོ་བདུན་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་སྤྱན་དྲངས་ཤིང་རི་མོར་བྱེད་དེ།
en: In Jambudvīpa there is the brahmin Samudrareṇu, the chief court priest of King Araṇemin, who for seven years is honoring and serving with all offerings the Tathāgata Ratnagarbha and his saṅgha of bhikṣus.

source: བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ཡང་དག་པར་འཛིན་དུ་བཅུག་པས་ཁོ་བོ་ཅག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར་སྐྱེད་མོས་ཚལ་ཐམས་ཅད་བརྒྱན་ཟིན་གྱིས།
en: At the brahmin Samudrareṇu’s instruction, we have adorned the entire parkland for the Bhagavat and his saṅgha of bhikṣus.

source: དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ཀྱང་དགེ་བའི་རྩ་བ་དེ་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག །
en: You, too, should rejoice in that root of merit and develop the aspiration for the highest, most complete enlightenment.’ “

source: དེའི་ཚེ་ན་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ་ཚིག་ཏུ་སྨྲས་པ། གྲོགས་པོ་བདག་ཅག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱ་ཞིང་རྗེས་སུ་ཡི་རང་བ་དེ་ལས་བྱུང་བའི་བསོད་ནམས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །ལྷའི་བུ་རབ་འཐབ་བྲལ་གྱིས་ཀྱང་འཐབ་བྲལ་གྱི་ལྷའི་བུ་རྣམས་བསྡུས་ཏེ། རྒྱ་ཆེར་སྔ་མ་བཞིན་དུ་སྦྱར་བར་བྱའོ།
en: At that time, many hundreds of thousands of millions of trillions of Trāyastriṃśa devas placed their palms together and said, ‘Friends, we rejoice in that accumulation of merit, and we dedicate the merit that comes from that rejoicing to the highest, most complete enlightenment.’ “

source: །ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་དང་།
en: The deva Suyāma summoned the Yāma devas to assemble and said the same to them.

source: ལྷའི་བུ་འཕྲུལ་དགའ་དང་། ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱིས་ཀྱང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་བར་གྱི་ལྷའི་བུ་དག་བསྡུས་ནས་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ་ཚིག་ཏུ་སྨྲས་པ། གྲོགས་པོ་དག་བདག་ཅག་གིས་དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་བསོད་ནམས་གང་ཡིན་པ་དེ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱ་ཞིང་། དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱས།
en: The devas Saṃtuṣita and Sunirmita also summoned their devas to assemble, and so on, up to and including Para­nirmitavaśavartin summoning the Para­nirmitavaśavartin devas, and many hundreds of thousands of millions of trillions of devas placed their palms together and said, ‘Honorable ones, we rejoice in that accumulation of merit, and we dedicate it all to the highest, most complete enlightenment.

source: གྲོགས་པོ་དག་དེའི་ཕྱིར་འཛམ་བུའི་གླིང་དུ་འབབ་ཅིང་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འདོང་ངོ་།
en: Honorable ones, we will therefore descend to Jambudvīpa and go to see the Bhagavat and his saṅgha of bhikṣus to pay homage to them, honor them, and listen to the Dharma.’ “

source: །ལྷའི་རྒྱལ་པོ་དེ་ལྔ་ནུབ་མོ་ལྷའི་རྒྱལ་པོ་རེ་རེ་ཞིང་ཡང་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་དང་ལྷན་ཅིག་ཏུ་འཛམ་བུའི་གླིང་དུ་བབས་ཏེ།
en: That night, the five deva kings descended from their realms to Jambudvīpa, accompanied by many hundreds of thousands of millions of trillions of devas—male and female, boys and girls.

source: བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་ཏོ།
en: They bowed their heads to the feet of the Bhagavat and his saṅgha of bhikṣus and listened to the Dharma from the Bhagavat.

source: །ནམ་མཁའི་དཀྱིལ་ན་གནས་པའི་ལྷ་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། སྣ་མ་དང་། བར་ཤི་ཀ་དང་། ཨ་ཏི་མུག་ཏ་ཀ་དང་།
en: The devas who were in the middle of the sky released a rain of divine blue lotuses, red lotuses, water lilies, white lotuses, jasmine flowers, gardenias, mountain ebony flowers, magnolias, coral tree flowers, and great coral tree flowers onto the Bhagavat and played divine music. “

source: ཙམ་པ་ཀ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོའི་མེ་ཏོག་གི་ཆར་དག་འབེབས་ཤིང་ལྷའི་རོལ་མོའི་སྒྲ་དག་ཀྱང་རབ་ཏུ་སྒྲོགས་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་སེམས་ལ་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་ལྟ་བུ་སྐྱེས་ཏེ། གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་སྨོན་ལམ་འདི་ཡང་འགྲུབ་པ་ལྟ་ན།
en: Noble son, this thought arose in the brahmin Samudrareṇu’s mind: ‘If my aspiration for the highest, most complete enlightenment is to be completely fulfilled, then may my prayer that even asuras will be made to believe in enlightenment be fulfilled.’ “

source: འདི་ལྟར་ལྷ་མ་ཡིན་དག་ཀྱང་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་གྱུར་ཅིག་སྙམ་མོ། །རིགས་ཀྱི་བུ་དེས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་གནོད་སྦྱིན་གྱི་དབང་པོ་ལྔ་བྲམ་ཟེ་དེ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་པ་ནས། བྲམ་ཟེའི་ཚིག་གིས་ལྷ་མ་ཡིན་སྐྱེས་པ་དང་།
en: Noble son, as soon as he thought that, the five lords of the asuras came to the brahmin.

source: བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་བཅས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་འོངས་ནས་ཆོས་ཉན་པའི་བར་དུ་སྔ་མ་བཞིན་དུ་རྒྱ་ཆེར་སྦྱར་རོ། །དེ་བཞིན་དུ་བྲམ་ཟེ་དེ་བདུད་འདོད་པ་དང་།
en: After they arrived, they were instructed by the brahmin, and many hundreds of thousands of millions of trillions of asuras—male and female, boys and girls—developed the aspiration for the highest, most complete enlightenment and came to the Bhagavat to listen to the Dharma. “

source: དེའི་ཚེ་ན་བདུད་གང་པོ་ཞེས་བྱ་བ་འོངས་པ་ནས་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་བཅས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་བར་དང་། ཆོས་མཉན་པའི་ཕྱིར་ལྷགས་པའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: At that time, the māra named Pūrṇa also came, and many hundreds of thousands of millions of trillions of male and female and boy and girl māras developed the aspiration for the highest, most complete enlightenment, and came to the Bhagavat to listen to the Dharma. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་ཡང་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་ཚངས་པ་ཆེན་པོ་གནས་པའི་གྲོང་ཁྱེར་ཞེས་བྱ་བ་འོང་བར་འདོད་པ་ནས་བྲམ་ཟེ་ལས་མཉན་ཅིང་ཚངས་པའི་འཇིག་རྟེན་དུ་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བཅོམ་ལྡན་འདས་དང་།
en: Noble son, in the same way, the brahmin Samudrareṇu wished that the great Brahmā, who was named Ketapuri, would come. Then that great Brahmā came and received the brahmin’s instructions.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་པའི་ཕྱིར་དེ་ནས་བབས་པའི་བར་དུ་སྔ་མ་བཞིན་དུ་སྦྱར་རོ།
en: Then many hundreds of thousands of millions of trillions of devas in the Brahmā realm developed the aspiration for the highest, most complete enlightenment; they descended from the Brahmā realm in order to see the Bhagavat and his saṅgha of bhikṣus and to pay homage to them, honor them, and listen to the Dharma from the Bhagavat. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་ཡང་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གླིང་བཞི་པ་གཉིས་པའི་བརྒྱ་བྱིན་མཐོང་བར་འདོད་ཅིང་ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། རབ་འཕྲུལ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་དང་མཐོང་བར་འདོད་པ་དང་།
en: Noble son, the brahmin Samudrareṇu then wished to see the Śakra, Suyāma, Saṃtuṣita, Sunirmita, and Para­nirmitavaśavartin devas who were in a second four-continent world.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ལྷའི་རྒྱལ་པོ་དེ་ལྔ་ཡང་བྲམ་ཟེའི་དྲུང་དུ་ལྷགས་ནས་བྲམ་ཟེ་དེས་དེ་དག་ཡང་དག་པར་རྗེས་སུ་བསྟན་པ་དང་།
en: Through the power of the Bhagavat those five deva kings came to the brahmin.

source: དེ་དག་ཀྱང་རང་རང་གི་ལྷའི་གནས་དག་ཏུ་དོང་ནས་བྲམ་ཟེའི་ཚིག་གིས་རང་རང་གི་འཁོར་རྣམས་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ།
en: The brahmin instructed them, they returned to their own deva realms, and they instructed their devas with the brahmin’s words. “

source: །དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་བུ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་བཅས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་དེ་དག་ཀྱང་བརྒྱ་བྱིན་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དང་།
en: As a result, many hundreds of thousands of millions of trillions of Trāyastriṃśa devas—male and female, boys and girls—developed the aspiration for the highest, most complete enlightenment.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་པའི་ཕྱིར་གླིང་བཞི་པ་འདིར་ལྷགས་སོ། །དེ་བཞིན་དུ་ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་།
en: The five deva kings then came with that Śakra to this four-continent world to see the Bhagavat and his saṅgha of bhikṣus, pay homage to them, honor them, and listen to the Dharma from the Bhagavat. “

source: ཡོངས་སུ་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་རྣམས་ཀྱིས་ཀྱང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་བར་གྱི་ལྷའི་བུ་རྣམས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ནས། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་བར་གྱི་ལྷའི་བུ་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་།
en: In the same way, the devas Suyāma, Saṃtuṣita, Sunirmita, and Para­nirmitavaśavartin instructed their devas—up to and including the Para­nirmitavaśavartin devas—and as a result, these devas developed the aspiration for enlightenment.

source: བུ་མོ་དང་བཅས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་དག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་པའི་ཕྱིར་གླིང་བཞི་པ་འདིར་ལྷགས་སོ།
en: Many hundreds of thousands of millions of trillions of devas—male and female, boys and girls—who had developed the aspiration for the highest, most complete enlightenment came to this four-continent world to see the Bhagavat and his saṅgha of bhikṣus, pay homage to them, honor them, and listen to the Dharma from the Bhagavat. “

source: །གླིང་བཞི་པ་གཉིས་པའི་ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། བདུད་དང་། ཚངས་པ་རྣམས་ཀྱང་དེ་བཞིན་ནོ། །དེ་བཞིན་དུ་གླིང་བཞི་པ་གསུམ་པ་དང་། བཞི་པ་དང་།
en: It was the same with the lords of the asuras, Māra, and Brahmā from the second four-continent world. “

source: ལྔ་པའི་བར་དག་གི་བརྒྱ་བྱིན་དང་། ལྷའི་བུ་རབ་འཐབ་བྲལ་དང་། ཡོངས་སུ་དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་།
en: It was the same with Śakra, Suyāma, Saṃtuṣita, Sunirmita, Para­nirmitavaśavartin, the lords of the asuras, Māra, and Brahmā from the third four-continent world, from the fourth, and from the fifth.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། བདུད་དང་། ཚངས་པ་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཆོས་མཉན་པའི་བར་གྱི་ཕྱིར་དེ་དག་འཁོར་དང་བཅས་ཏེ་གླིང་བཞི་པ་འདིར་ལྷགས་སོ།
en: Through the power of the Bhagavat, they came with their followers to this four-continent world to listen to the Dharma. “
